//*************************************************************************
//*************************************************************************
//**                                                                     **
//**        (C)Copyright 1985-2011, American Megatrends, Inc.            **
//**                                                                     **
//**                       All Rights Reserved.                          **
//**                                                                     **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093           **
//**                                                                     **
//**                       Phone: (770)-246-8600                         **
//**                                                                     **
//*************************************************************************
//*************************************************************************
//
//*************************************************************************
// $Header: $
//
// $Revision: $
//
// $Date: $
//*************************************************************************
// Revision History
// ----------------
// $Log: $
// 
//*************************************************************************
//<AMI_FHDR_START>
//
// Name:  <F81866.UNI>
//
// Description: SIO Form String Definitions
//
//<AMI_FHDR_END>
//*************************************************************************
/=#
#include "VFR.uni"
#string STR_F81866_SIO_FORM                        #language eng "F81866 Super IO Configuration"
#string STR_F81866_SIO_FORM_HELP                   #language eng "System Super IO Chip Parameters."
#string STR_F81866_SIO_PROMPT                      #language eng "F81866 Super IO Chip"
#string STR_F81866                                 #language eng "F81866"

//
//Floppy Settings
//
#string STR_F81866_FLOPPY_FORM                     #language eng "Floppy Disk Controller Configuration"
#string STR_F81866_FLOPPY_FORM_HELP                #language eng "Set Parameters of Floppy Disk Controller (FDC)"
#string STR_F81866_FLOPPY_PROMPT                   #language eng "Floppy Disk Controller"
#string STR_F81866_FLOPPY_PROMPT_HELP              #language eng "Enable or Disable Floppy Disk Controller"
#string STR_F81866_FLOPPY_MODE_HELP                #language eng "Change mode of Floppy Disk Controller. Select 'Read Write' for normal operation. Select 'Write Protect' mode for read only operation."
#string STR_F81866_FLOPPY_MODE1                    #language eng "Read Write"
#string STR_F81866_FLOPPY_MODE2                    #language eng "Write Protect"
#string STR_F81866_FLOPPY_CONFIG_VALUE             #language eng "Reset Required"

#string STR_F81866_FLOPPY_SETTINGS1                #language eng "IO=3F0h; IRQ=6; DMA=2;"
//#string STR_F81866_FLOPPY_SETTINGS2                #language eng "IO=3F0h; IRQ=3,4,5,6,7,10,11,12; DMA=2,3;"
//#string STR_F81866_FLOPPY_SETTINGS3                #language eng "IO=370h; IRQ=3,4,5,6,7,10,11,12; DMA=2,3;"

//
//Serial 1/2/3/4/5/6 Settings
//
#string STR_F81866_SERIAL0_FORM                    #language eng "Serial Port 0 Configuration"
#string STR_F81866_SERIAL0_FORM_HELP               #language eng "Set Parameters of Serial Port 0 (COMA)"
#string STR_F81866_SERIAL1_FORM                    #language eng "Serial Port 1 Configuration"
#string STR_F81866_SERIAL1_FORM_HELP               #language eng "Set Parameters of Serial Port 1 (COMB)"
#string STR_F81866_SERIAL2_FORM                    #language eng "Serial Port 2 Configuration"
#string STR_F81866_SERIAL2_FORM_HELP               #language eng "Set Parameters of Serial Port 2 (COMC)"
#string STR_F81866_SERIAL3_FORM                    #language eng "Serial Port 3 Configuration"
#string STR_F81866_SERIAL3_FORM_HELP               #language eng "Set Parameters of Serial Port 3 (COMD)"
#string STR_F81866_SERIAL4_FORM                    #language eng "Serial Port 4 Configuration"
#string STR_F81866_SERIAL4_FORM_HELP               #language eng "Set Parameters of Serial Port 4 (COME)"
#string STR_F81866_SERIAL5_FORM                    #language eng "Serial Port 5 Configuration"
#string STR_F81866_SERIAL5_FORM_HELP               #language eng "Set Parameters of Serial Port 5 (COMF)"
#string STR_F81866_SERIAL_PROMPT                   #language eng "Serial Port"
#string STR_F81866_SERIAL_PROMPT_HELP              #language eng "Enable or Disable Serial Port (COM)"

//#string STR_F81866_SERIAL_MODE1                    #language eng "RS232 driver"
//#string STR_F81866_SERIAL_MODE2                    #language eng "RS485 driver"
#string STR_F81866_SERIAL6_MODE1                   #language eng "Disable IR1 function"
#string STR_F81866_SERIAL6_MODE2                   #language eng "Enable IR1 function, active pulse 1.6uS"
#string STR_F81866_SERIAL6_MODE3                   #language eng "Enable IR1 function, active pulse 3/16 bit time"

#string STR_F81866_SERIAL_MODE_HELP                #language eng "Change the Serial Port mode. Select <High Speed> or <Normal mode> mode"
#string STR_F81866_SERIAL0_CONFIG_VALUE            #language eng "Reset Required"
#string STR_F81866_SERIAL1_CONFIG_VALUE            #language eng "Reset Required"
#string STR_F81866_SERIAL2_CONFIG_VALUE            #language eng "Reset Required"
#string STR_F81866_SERIAL3_CONFIG_VALUE            #language eng "Reset Required"
#string STR_F81866_SERIAL4_CONFIG_VALUE            #language eng "Reset Required"
#string STR_F81866_SERIAL5_CONFIG_VALUE            #language eng "Reset Required"

#string STR_F81866_SERIAL0_SETTINGS1               #language eng "IO=3F8h; IRQ=4;"
#string STR_F81866_SERIAL1_SETTINGS1               #language eng "IO=2F8h; IRQ=3;"
#string STR_F81866_SERIAL2_SETTINGS1               #language eng "IO=3E8h; IRQ=11;"
#string STR_F81866_SERIAL3_SETTINGS1               #language eng "IO=2E8h; IRQ=11;"
#string STR_F81866_SERIAL4_SETTINGS1               #language eng "IO=278h; IRQ=10;"
#string STR_F81866_SERIAL5_SETTINGS1               #language eng "IO=270h; IRQ=10;"
#string STR_F81866_SERIAL_SETTINGS2                #language eng "IO=3F8h; IRQ=4;"
#string STR_F81866_SERIAL_SETTINGS3                #language eng "IO=2F8h; IRQ=3;"
#string STR_F81866_SERIAL_SETTINGS4                #language eng "IO=3E8h; IRQ=11;"
#string STR_F81866_SERIAL_SETTINGS5                #language eng "IO=2E8h; IRQ=11;"
#string STR_F81866_SERIAL_SETTINGS6                #language eng "IO=278h; IRQ=10;"
#string STR_F81866_SERIAL_SETTINGS7                #language eng "IO=270h; IRQ=10;"

//
//Parallel Settings
//
#string STR_F81866_PARALLEL_FORM                   #language eng "Parallel Port Configuration"
#string STR_F81866_PARALLEL_FORM_HELP              #language eng "Set Parameters of Parallel Port (LPT/LPTE)"

#string STR_F81866_PARALLEL_PROMPT                 #language eng "Parallel Port"
#string STR_F81866_PARALLEL_PROMPT_HELP            #language eng "Enable or Disable Parallel Port (LPT/LPTE)"

#string STR_F81866_PARALLEL_MODE0                  #language eng "STD Printer Mode"
#string STR_F81866_PARALLEL_MODE1                  #language eng "SPP Mode"
#string STR_F81866_PARALLEL_MODE2                  #language eng "EPP-1.9 and SPP Mode"
#string STR_F81866_PARALLEL_MODE3                  #language eng "EPP-1.7 and SPP Mode"
#string STR_F81866_PARALLEL_MODE4                  #language eng "ECP Mode"
#string STR_F81866_PARALLEL_MODE5                  #language eng "ECP and EPP 1.9 Mode"
#string STR_F81866_PARALLEL_MODE6                  #language eng "ECP and EPP 1.7 Mode"
#string STR_F81866_PARALLEL_CONFIG_VALUE           #language eng "Reset Required"
#string STR_F81866_PARALLEL_MODE_HELP              #language eng "Change the Printer Port mode."

#string STR_F81866_PARALLEL_SETTINGS0              #language eng "IO=378h; IRQ=5;"
#string STR_F81866_PARALLEL_SETTINGS1              #language eng "IO=378h; IRQ=5,6,7,10,11,12;"
#string STR_F81866_PARALLEL_SETTINGS2              #language eng "IO=278h; IRQ=5,6,7,10,11,12;"
#string STR_F81866_PARALLEL_SETTINGS3              #language eng "IO=3BCh; IRQ=5,6,7,10,11,12;"
#string STR_F81866_PARALLEL_SETTINGS4              #language eng "IO=378h;"
#string STR_F81866_PARALLEL_SETTINGS5              #language eng "IO=278h;"
#string STR_F81866_PARALLEL_SETTINGS6              #language eng "IO=3BCh;"

#string STR_F81866_PARALLELE_SETTINGS0             #language eng "IO=378h; IRQ=5; DMA=3;"
#string STR_F81866_PARALLELE_SETTINGS1             #language eng "IO=378h; IRQ=5,6,7,10,11,12; DMA=1,3;"
#string STR_F81866_PARALLELE_SETTINGS2             #language eng "IO=278h; IRQ=5,6,7,10,11,12; DMA=1,3;"
#string STR_F81866_PARALLELE_SETTINGS3             #language eng "IO=3BCh; IRQ=5,6,7,10,11,12; DMA=1,3;"
#string STR_F81866_PARALLELE_SETTINGS4             #language eng "IO=378h; DMA=1,3;"
#string STR_F81866_PARALLELE_SETTINGS5             #language eng "IO=278h; DMA=1,3;"
#string STR_F81866_PARALLELE_SETTINGS6             #language eng "IO=3BCh; DMA=1,3;"

//
//PME Settings
//
#string STR_F81866_PME_WAKE_FROM_KEY               #language eng "Wake on Specific Key"
#string STR_F81866_POWER_FAILURE_PROMPT            #language eng "Power Failure"
#string STR_F81866_POWER_FAILURE_SETTING1          #language eng "Keep last state"
#string STR_F81866_POWER_FAILURE_SETTING2          #language eng "Bypass mode"
#string STR_F81866_POWER_FAILURE_SETTING3          #language eng "Always on"
#string STR_F81866_POWER_FAILURE_SETTING4          #language eng "Always off"

//
// Generic setting 
//
#string STR_SETTINGS_HELP                               #language eng "Select an optimal setting for Super IO device."
#string STR_AUTO                                        #language eng "Auto"
#string STR_CHANGE_CONFIG                               #language eng "Change Settings"
#string STR_CURRENT_CONFIG                              #language eng "Device Settings"
#string STR_SELECT_MODE                                 #language eng "Device Mode"
//
// HardWare Monitor 
//
#string STR_F81866_HMM_CONFIGURATION               #language eng "F81866 H/W Monitor"
#string STR_F81866_HMM_CONFIGURATION_HELP          #language eng "Monitor hardware status"

#string STR_PC_HEALTH                                   #language eng "Pc Health Status"
#string STR_F81866_SYSTEM_TEMP1                    #language eng "System temperature1"
#string STR_F81866_SYSTEM_TEMP1_VALUE              #language eng "N/A"
#string STR_F81866_SYSTEM_TEMP2                    #language eng "System temperature2"
#string STR_F81866_SYSTEM_TEMP2_VALUE              #language eng "N/A"
#string STR_F81866_SYSTEM_TEMP3                    #language eng "System temperature3"
#string STR_F81866_SYSTEM_TEMP3_VALUE              #language eng "N/A"
#string STR_F81866_SYSTEM_TEMP4                    #language eng "System temperature4"
#string STR_F81866_SYSTEM_TEMP4_VALUE              #language eng "N/A"
#string STR_F81866_SYSTEM_TEMP5                    #language eng "System temperature5"
#string STR_F81866_SYSTEM_TEMP5_VALUE              #language eng "N/A"
#string STR_F81866_SYSTEM_TEMP6                    #language eng "System temperature6"
#string STR_F81866_SYSTEM_TEMP6_VALUE              #language eng "N/A"

#string STR_F81866_FAN1_SPEED                      #language eng "Fan1 Speed"
#string STR_F81866_FAN1_SPEED_VALUE                #language eng "N/A"
#string STR_F81866_FAN2_SPEED                      #language eng "Fan2 Speed"
#string STR_F81866_FAN2_SPEED_VALUE                #language eng "N/A"
#string STR_F81866_FAN3_SPEED                      #language eng "Fan3 Speed"
#string STR_F81866_FAN3_SPEED_VALUE                #language eng "N/A"
#string STR_F81866_FAN4_SPEED                      #language eng "Fan4 Speed"
#string STR_F81866_FAN4_SPEED_VALUE                #language eng "N/A"
#string STR_F81866_FAN5_SPEED                      #language eng "Fan5 Speed"
#string STR_F81866_FAN5_SPEED_VALUE                #language eng "N/A"

#string STR_F81866_HMM_VIN1                            #language eng "VIN1"
#string STR_F81866_HMM_VIN1_VALUE                      #language eng "N/A"
#string STR_F81866_HMM_VIN2                            #language eng "VIN2"
#string STR_F81866_HMM_VIN2_VALUE                      #language eng "N/A"
#string STR_F81866_HMM_VIN3                            #language eng "VIN3"
#string STR_F81866_HMM_VIN3_VALUE                      #language eng "N/A"
#string STR_F81866_HMM_VIN4                            #language eng "VIN4"
#string STR_F81866_HMM_VIN4_VALUE                      #language eng "N/A"

#string STR_F81866_HMM_VCC3V                           #language eng "VCC3V"
#string STR_F81866_HMM_VCC3V_VALUE                     #language eng "N/A"
#string STR_F81866_HMM_VSB5V                           #language eng "VSB5V"
#string STR_F81866_HMM_VSB5V_VALUE                     #language eng "N/A"
#string STR_F81866_HMM_VSB3V                           #language eng "VSB3V"
#string STR_F81866_HMM_VSB3V_VALUE                     #language eng "N/A"
#string STR_F81866_HMM_VBAT                            #language eng "VBAT"
#string STR_F81866_HMM_VBAT_VALUE                      #language eng "N/A"

//Smart Fan setting
#string STR_F81866_SMARTFAN_PROMPT                     #language eng "Smart Fan Function"
#string STR_F81866_SMARTFAN_PROMPT_HELP                #language eng "Enable or Disable Smart Fan"
#string STR_F81866_SMARTFAN_FORM                       #language eng "Smart Fan Mode Configuration"
#string STR_F81866_SMARTFAN_FORM_HELP                  #language eng "Smart Fan Mode Select"
#string STR_F81866_SMARTFAN_CONFIG_HELP                #language eng "Smart Fan  Mode Select"

#string STR_F81866_SMARTFAN_FAN1                       #language eng "Fan 1 Smart Fan Control"
#string STR_F81866_SMARTFAN_FAN2                       #language eng "Fan 2 Smart Fan Control"
#string STR_F81866_SMARTFAN_FAN3                       #language eng "Fan 3 Smart Fan Control"
#string STR_F81866_SMARTFAN_FAN_MODE0                  #language eng "Manual RPM Mode"
#string STR_F81866_SMARTFAN_FAN_MODE1                  #language eng "Manual Duty Mode"
#string STR_F81866_SMARTFAN_FAN_MODE2                  #language eng "Auto RPM Mode"
#string STR_F81866_SMARTFAN_FAN_MODE3                  #language eng "Auto Duty-Cycle Mode"

#string STR_F81866_SMARTFAN_FAN_MODE0_HELP             #language eng "Manual mode fan control, user can write expected RPM count 500-10000"
#string STR_F81866_SMARTFAN_FAN_MODE1_HELP             #language eng "Manual mode fan control, user can write expected duty cycle (PWM fan type) 1-100"
#string STR_F81866_SMARTFAN_FAN_MODE2_HELP             #language eng "Auto fan speed control. Fan speed will follow different temperature by different RPM 1-100"
#string STR_F81866_SMARTFAN_FAN_MODE3_HELP             #language eng "Auto fan speed control. Fan speed will follow different temperature by different duty cycle 1-100"
#string STR_F81866_SMARTFAN_FAN_AUTO_RPM_T1            #language eng "Temperature 1"
#string STR_F81866_SMARTFAN_FAN_AUTO_RPM_T2            #language eng "Temperature 2"
#string STR_F81866_SMARTFAN_FAN_AUTO_RPM_T3            #language eng "Temperature 3"
#string STR_F81866_SMARTFAN_FAN_AUTO_RPM_T4            #language eng "Temperature 4"
#string STR_F81866_SMARTFAN_FAN_AUTO_RPM_F1            #language eng "RPM Percentage 1"
#string STR_F81866_SMARTFAN_FAN_AUTO_RPM_F2            #language eng "RPM Percentage 2"
#string STR_F81866_SMARTFAN_FAN_AUTO_RPM_F3            #language eng "RPM Percentage 3"
#string STR_F81866_SMARTFAN_FAN_AUTO_RPM_F4            #language eng "RPM Percentage 4"
#string STR_F81866_SMARTFAN_FAN_AUTO_DUTY_T1           #language eng "Temperature 1"
#string STR_F81866_SMARTFAN_FAN_AUTO_DUTY_T2           #language eng "Temperature 2"
#string STR_F81866_SMARTFAN_FAN_AUTO_DUTY_T3           #language eng "Temperature 3"
#string STR_F81866_SMARTFAN_FAN_AUTO_DUTY_T4           #language eng "Temperature 4"
#string STR_F81866_SMARTFAN_FAN_AUTO_DUTY_F1           #language eng "Duty Cycle 1"
#string STR_F81866_SMARTFAN_FAN_AUTO_DUTY_F2           #language eng "Duty Cycle 2"
#string STR_F81866_SMARTFAN_FAN_AUTO_DUTY_F3           #language eng "Duty Cycle 3"
#string STR_F81866_SMARTFAN_FAN_AUTO_DUTY_F4           #language eng "Duty Cycle 4"
    
//#string <string name>                   #language eng ""
//*************************************************************************
//*************************************************************************
//**                                                                     **
//**        (C)Copyright 1985-2011, American Megatrends, Inc.            **
//**                                                                     **
//**                       All Rights Reserved.                          **
//**                                                                     **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093           **
//**                                                                     **
//**                       Phone: (770)-246-8600                         **
//**                                                                     **
//*************************************************************************
//*************************************************************************